In [20]:
import matplotlib.pyplot as plt
import numpy as np
import seaborn
import pandas as pd
from pandas import DataFrame, Series
%matplotlib inline

In [46]:
batting_data = pd.read_csv('Data/core/Batting.csv', sep = ",", dtype = str)

In [47]:
batting_data.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0,0,0,0,0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13,8,1,4,0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NaN,29,137,28,40,4,...,19,3,1,2,5,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NaN,27,133,28,44,10,...,27,1,1,0,2,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NaN,25,120,29,39,11,...,16,6,2,2,1,NaN,NaN,NaN,NaN,NaN

In [48]:
salary_data = pd.read_csv('Data/core/Salaries.csv', sep = ",", dtype = str)

In [45]:
salary_data.head()

  yearID teamID lgID   playerID  salary
0   1985    ATL   NL  barkele01  870000
1   1985    ATL   NL  bedrost01  550000
2   1985    ATL   NL  benedbr01  545000
3   1985    ATL   NL   campri01  633333
4   1985    ATL   NL  ceronri01  625000

In [49]:
amalgamated_data = pd.merge(batting_data, salary_data)

In [50]:
amalgamated_data.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,salary
0,ackerji01,1985,1,TOR,AL,61,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,170000
1,agostju01,1985,1,CHA,AL,54,0,0,0,0,...,0,0,0,0,0,0,0,0,0,147500
2,aguaylu01,1985,1,PHI,NL,91,165,27,46,7,...,1,0,22,26,5,6,4,3,7,237000
3,alexado01,1985,1,TOR,AL,36,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,875000
4,allenne01,1985,1,SLN,NL,23,2,0,0,0,...,0,0,0,2,0,0,0,0,0,750000

In [51]:
amalgamated_data['salary'].head()

0    170000
1    147500
2    237000
3    875000
4    750000
Name: salary, dtype: object

In [52]:
relevant_data = amalgamated_data[['playerID', 'AB', 'H', 'BB', 'HBP', 'SF', 'salary']]

In [53]:
relevant_data.head()

    playerID   AB    H   BB  HBP   SF  salary
0  ackerji01  NaN  NaN  NaN  NaN  NaN  170000
1  agostju01    0    0    0    0    0  147500
2  aguaylu01  165   46   22    6    3  237000
3  alexado01  NaN  NaN  NaN  NaN  NaN  875000
4  allenne01    2    0    0    0    0  750000

In [71]:
# cleaned_data = relevant_data.replace('NaN', '0')

In [72]:
# cleaned_data.head()

In [77]:
cleaned_data = relevant_data.fillna(0)

In [78]:
cleaned_data.head()

    playerID   AB   H  BB HBP SF  salary
0  ackerji01    0   0   0   0  0  170000
1  agostju01    0   0   0   0  0  147500
2  aguaylu01  165  46  22   6  3  237000
3  alexado01    0   0   0   0  0  875000
4  allenne01    2   0   0   0  0  750000

In [74]:
# def c10_to_f(temp):
#     return ((temp / 10) * (9 / 5) + 32).round(1)
# rdu_temps['temp_max'] = c10_to_f(rdu_temps.pop('TMAX'))
# rdu_temps['temp_min'] = c10_to_f(rdu_temps.pop('TMIN'))
# rdu_temps.head()

In [75]:
def get_obp(hits, walks, hit_by_pitch, at_bats, sacrifice_flies):
    return ((int(hits) + int(walks) + int(hit_by_pitch))/(int(at_bats) + int(walks) + int(hit_by_pitch) + int(sacrifice_flies)))

In [76]:
cleaned_data['OBP'] = get_obp(cleaned_data['H'], cleaned_data['BB'], cleaned_data['HBP'], cleaned_data['AB'], cleaned_data['SF'])

TypeError: cannot convert the series to <class 'int'>